tutorials/multiple-perpendicular-flaps/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh-Centers;
    patches           (flap1);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Stress1
    );
  };
  
  Interface2
  {
    mesh              Fluid1-Mesh-Nodes;
    patches           (flap1);
    locations         faceNodes;
    
    readData
    (
      Displacement1
    );
    
    writeData
    (
    );
  };
  
  Interface3
  {
    mesh              Fluid2-Mesh-Centers;
    patches           (flap2);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Stress2
    );
  };
  
  Interface4
  {
    mesh              Fluid2-Mesh-Nodes;
    patches           (flap2);
    locations         faceNodes;
    
    readData
    (
      Displacement2
    );
    
    writeData
    (
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}
